examples/BESS/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 302;

boundaryField
{
    "(northbc|southbc|eastbc|westbc|topbc|bottombc)"
    {
        type            zeroGradient;
    }

    inner
    {
        type            fixedValue;
        value           uniform 308;
    }

    default
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 302;
    }

    return1
    {        
        type            zeroGradient;
    }

}


// ************************************************************************* //
