examples/BESS/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    "(northbc|southbc|eastbc|westbc|topbc|bottombc)"
    {
        type            calculated;
        value           $internalField;
    }

    inner
    {
        type            calculated;
        value           $internalField;
    }

    default
    {
        type            calculated;
        value           $internalField;
    }

    "(inlet|return1)"
    {
        type            calculated;
        value           $internalField;        
    }
}


// ************************************************************************* //
