examples/BESS/constant/reaction
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

reaction
{
    reaction      "CH4 + 2O2 + 7.5N2 = CO2 + 2H2O + 7.5N2";
}

// ************************************************************************* //
