examples/BESS/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f0;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.982 -0.15 1.0)(0.988 0.15 1.3);
    }
    {
        name    f1;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.480 -0.970 0.7)(0.51 -0.964 0.3);
    } 


);

// ************************************************************************* //
